"""Task 2. Qubizm"""
import math

usl = ("2. С клавиатуры вводятся радиус окружности и сторона квадрата (первым вводится радиус окружности)."
       "Необходимо рассчитать длину окружности, площадь круга ограниченного этой окружностью и площадь квадрата."
       "На экран выводятся результаты вычисления в следующем виде: Длина окружности равно <длина окружности>."
       "Площадь круга составляет <отношение площади круга к площади квадрата> % от площади квадрата."
       "Значения округляются до сотых. Вывод на экран должен быть реализован в одном print()")

r, a = int(input()), int(input())


print(f"Длина окружности равно {2 * math.pi * r}.", f"Площадь круга составляет {math.pi * r ** 2 / a ** 2}% от площади квадрата.")